titulo_inicio = Sistemas E/S
creadores = Creado por:
carrera = Ingenier\u00eda en Sistemas - 2023
profesor = Ingeniero Eduardo Rueda
nombre1 = Camilo Mora y

spanish = Espa\u00f1ol
english = Ingles

menu = Menu
context = Contexto

titleMenu = Contenido
context_Overview = Contexto - Panorama general
ioHardware = Hardware de E/S
applicationIoInterface = Aplicaci\u00f3n Interfaz de E/S
kernelSubsystem = Subsistema de E/S del n\u00facleo
transRequestHardwareOperations = Transformaci\u00f3n de solicitudes de E/S en operaciones de hardware
performance = Rendimiento

#overview

overviewLabel1=\u2714 La gesti\u00f3n de E/S es un componente importante del dise\u00f1o y el funcionamiento de los sistemas operativos
overviewLabel2=> Aspecto importante del funcionamiento de un ordenador
overviewLabel3=> Los dispositivos de E/S son muy variados
overviewLabel4=> Varios m\u00e9todos para controlarlos
overviewLabel5=> Gesti\u00f3n del rendimiento 
overviewLabel6=> Son frecuentes los nuevos tipos de dispositivos
overviewLabel7=\u2714 Puertos, buses, controladores de dispositivos se conectan a varios dispositivos
overviewLabel8=\u2714 Los controladores de dispositivos encapsulan los detalles de los dispositivos
overviewLabel9=> Presentan una interfaz uniforme de acceso de dispositivos al subsistema de E/S

#Hardware de E/S
ioHardwareLabel1=\u2714 Incre\u00edble variedad de dispositivos de E/S 
ioHardwareLabel2=> Almacenamiento
ioHardwareLabel3=> Transmisi\u00f3n
ioHardwareLabel4=> Interfaz humana
ioHardwareLabel5=\u2714 Conceptos comunes - las se\u00f1ales de los dispositivos de E/S interact\u00faan con el ordenador 
ioHardwarePort=> Puerto
ioHardwarePortLabel6=- punto de conexi\u00f3n para dispositivo
ioHardwareBus=> Bus - conexi\u00f3n en cadena
ioHardwareBusLabel7=o acceso directo compartido
ioHardwarePCI=> PCI
ioHardwarePCILabel8=bus com\u00fan en PC y servidores, PCI Express
ioHardwarePCIe=(PCIe)
ioHardwareExpansionBus=> bus de expansi\u00f3n
ioHardwareExpansionBusLabel9=conecta dispositivos relativamente lentos
ioHardwareSerialAttached=> SCSI conectado en serie (SAS)
ioHardwareSerialAttachedLabel10=interfaz de disco com\u00fan
ioHardwareController=> Controlador (adaptador de host)
ioHardwareControllerLabel11=- electr\u00f3nica que opera puerto, bus, dispositivo
ioHardwareControllerLabel12=> A veces integrado
ioHardwareControllerLabel13=> A veces placa de circuito independiente (adaptador host)
ioHardwareControllerLabel14=> Contiene procesador, microc\u00f3digo, memoria privada, bus, controlador, etc.


#app i/o interface

appIoInterfaceLabel1=\u2714 Las llamadas al sistema de E/S encapsulan los comportamientos de los dispositivos en clases gen\u00e9ricas 
appIoInterfaceLabel2=\u2714 La capa de controladores de dispositivos oculta al n\u00facleo las diferencias entre controladores de E/S  
appIoInterfaceLabel3=\u2714 Los nuevos dispositivos que utilizan protocolos ya implementados no necesitan trabajo adicional 
appIoInterfaceLabel4=\u2714 Cada SO tiene sus propias estructuras de subsistemas de E/S y marcos de controladores de dispositivos 
appIoInterfaceLabel5=\u2714 Los dispositivos var\u00edan en muchas dimensiones 
appIoInterfaceLabel6=> Flujo de caracteres o bloque 
appIoInterfaceLabel7=> Acceso secuencial o aleatorio  
appIoInterfaceLabel8=> S\u00edncrono o as\u00edncrono (o ambos) 
appIoInterfaceLabel9=>Compartible o dedicada 
appIoInterfaceLabel10=> Velocidad de funcionamiento 
appIoInterfaceLabel11=> lectura-escritura, s\u00f3lo lectura o s\u00f3lo escritura 

#Kernel I/O Subsystem
kernelSubsystemLabel1=\u2714 El kernel act\u00faa como una capa intermedia entre las aplicaciones del usuario y el hardware,  
kernelSubsystemLabel2=facilitando la comunicaci\u00f3n eficiente y controlando el acceso a los dispositivos de entrada/salida. 
kernelSubsystemLabel3=Este componente organiza las solicitudes de E/S, asegurando la sincronizaci\u00f3n y coordinaci\u00f3n   
kernelSubsystemLabel4=adecuadas entre los diversos procesos.  
kernelSubsystemLabel5=Adem\u00e1s, la estructura de E/S del kernel juega un papel crucial en la administraci\u00f3n de recursos,   
kernelSubsystemLabel6=asignando prioridades y garantizando un uso equitativo de los dispositivos de E/S. En resumen,   
kernelSubsystemLabel7=esta estructura es fundamental para el correcto funcionamiento y la eficiencia global del sistema   
kernelSubsystemLabel8=operativo al gestionar las operaciones de entrada y salida.  


#Transforming I/O Requests to Hardware Operations
transformingReqToHardwareLabel1=\u2714 Cuando una aplicaci\u00f3n solicita una operaci\u00f3n de entrada/salida, el kernel interviene para 
transformingReqToHardwareLabel2=transformar esta solicitud en una serie de comandos comprensibles para el hardware subyacente, 
transformingReqToHardwareLabel3=ya sea un disco duro, una impresora u otro dispositivo. Este proceso implica la gesti\u00f3n de 
transformingReqToHardwareLabel4=controladores de dispositivo que se encargan de las operaciones espec\u00edficas de cada hardware.
transformingReqToHardwareLabel5=La transformaci\u00f3n eficiente de las solicitudes de E/S en operaciones de hardware es esencial para 
transformingReqToHardwareLabel6=garantizar un rendimiento \u00f3ptimo del sistema. El kernel coordina y sincroniza estas operaciones 
transformingReqToHardwareLabel7=para evitar conflictos y asegurar un acceso ordenado y equitativo a los recursos del hardware. En 
transformingReqToHardwareLabel8=\u00faltima instancia, esta transformaci\u00f3n facilita la interacci\u00f3n armoniosa entre las aplicaciones del 
transformingReqToHardwareLabel9=usuario y los dispositivos f\u00edsicos del sistema.

#Performance
performanceLabel1=\u2714 El rendimiento puede evaluarse mediante la medici\u00f3n de varios indicadores, como el tiempo de 
performanceLabel2=respuesta de las aplicaciones, la velocidad de ejecuci\u00f3n de las operaciones de entrada/salida, la 
performanceLabel3=capacidad de manejar m\u00faltiples tareas simult\u00e1neamente, entre otros.
performanceLabel4=\u2714 El dise\u00f1o eficiente de algoritmos, la gesti\u00f3n adecuada de la memoria, la planificaci\u00f3n de procesos 
performanceLabel5=y la optimizaci\u00f3n de las operaciones de entrada/salida son aspectos cr\u00edticos para mejorar el 
performanceLabel6=rendimiento del sistema operativo. Adem\u00e1s, la implementaci\u00f3n de t\u00e9cnicas como la cach\u00e9 y la 
performanceLabel7=gesti\u00f3n eficiente de recursos contribuyen significativamente a la mejora del rendimiento.


